org-mode/index.html
<!DOCTYPE html>

<html lang="en-us">
    <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <meta name="format-detection" content="telephone=no"/>

    <title>Learning Org Mode | Neil Grogan</title>
    
    <link rel="apple-touch-icon" sizes="180x180" href="../apple-touch-icon.png">
    <link rel="icon" type="image/png" sizes="32x32" href="../favicon-32x32.png">
    <link rel="icon" type="image/png" sizes="16x16" href="../favicon-16x16.png">
    <link rel="icon" type="image/png" sizes="96x96" href="../favicon-96x96.png">
    <link rel="manifest" href="../manifest.json">
    <link rel="mask-icon" href="../safari-pinned-tab.svg" color="#FF3DB4">
    <link rel="me" href="https://mastodon.ie/@dueyfinster">
    <meta name="theme-color" content="#ffffff">

    
    
    
    <link rel="stylesheet" href="../css/main.min.113b8750726301d2272b2fabf9695ed6bfe79dff4f4cd582cb3010010ebceea4.css"/>

    
    
    

    
    

 
    
  

</head>

    <body>
        
<nav>
  <header>
    <div class="site-title">
        <a href="../">Neil Grogan</a>
    </div>  
</header>

  <div class="nav-menu">
  
    <a class="color-link nav-link" href="../about">About</a>
  
    <a class="color-link nav-link" href="../uses">Uses</a>
  
    <a class="color-link nav-link" href="../contact">Contact</a>
  
    <a class="color-link nav-link" href="../archives/">Archives</a>
  
    <a class="color-link nav-link" href="../tags/">Tags</a>
  
  <a class="color-link nav-link" href="../index.xml" target="_blank" rel="noopener" type="application/rss+xml">RSS</a>
</div>
<footer class="footer">
	<div class="social-icons">
        

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    
    
    

    
    
    

    

    

    

    

    

</div>




	<script src="../js/main.min.a7205ef73b078c8daed6fe1b0826e8ba229ffabbb69d299d9446cf41f2c7d8aa.js" integrity="sha256-pyBe9zsHjI2u1v4bCCbouiKf+ru2nSmdlEbPQfLH2Ko=" crossorigin="anonymous"></script><script src="../js/lunr-search.js" ></script>
</footer>
</nav>

        <div id="content" class="content-container">
        

<h1 class="post-title">Learning Org Mode</h1>
    
    <time>May 20, 2018</time>
    

    <div>
        
        <p>
        
<p>
Since hearing about <a href="https://orgmode.org">org-mode</a> on the web many years ago, I always meant to give it a spin. I only ever found <del>one</del> two problems:</p>
<ol>
<li>Time - Life eh?</li>
<li>It&#39;s a mode of <a href="https://www.gnu.org/software/emacs/">Emacs</a> for which I&#39;d also have to learn (again time)</li>
</ol>
<p>So I recently set about solving both shortcomings, as painful as it was to dismiss all the effort I put in to my <a href="https://www.vim.org">vim</a> <a href="https://en.wikipedia.org/wiki/Muscle_memory">muscle memory</a> over the years. The tough part usually is finding good documentation that is both easy to read and follow.</p>
<div id="outline-container-headline-1" class="outline-3">
<h3 id="headline-1">
So what is org-mode?
</h3>
<div id="outline-text-headline-1" class="outline-text-3">
<p>To put it simply, Org-mode is an editing mode of Emacs, which allows you to write plain text TODO lists. But it is also a lot more. You can:</p>
<ul>
<li>Use plain text tables</li>
<li>Run snippets of code (and edit them in their own file with proper formatting)</li>
<li>Use plain text spreadsheets</li>
<li>Export to many, many formats (Latex, PDF, HTML) or a custom format</li>
<li>Agenda mode for many ways to look at your TODOs</li>
</ul>
<p>This all sounds complicated, but the beautiful thing about org-mode is that it gradually reveals the features it has. You can only ever write a simple list like this if you want:</p>
<div class="src src-org">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-org" data-lang="org"><span style="display:flex;"><span>*<span style="font-weight:bold"> My First org mode outline</span>
</span></span><span style="display:flex;"><span><span style="color:#75715e">**</span><span style="color:#960050;background-color:#1e0010"> TODO</span> Must read the org manual</span></span></code></pre></div>
</div>
<p>
and that&#39;s it. Really. You don&#39;t need to use any of the other features if you don&#39;t want to. This is also a reason that it was a joy to learn: it never pushes unnecessary complication on the user. I wish I could say the same for Emacs! Although to be fair, Emacs is probably easier then Vim to get started in.</p>
<p>
## Combining Emacs + Org: Literate Programming</p>
<p>
So this was the fun part: how can I combine learning Emacs and Org? It turns out, I can create my whole Emacs configuration file in org-mode, and it will convert it Emacs Lisp. This is brilliant because in org-mode, we can annotate and explain <em>everything</em>. Take a look at this:</p>
<pre class="example">
* Packages
  Let&#39;s fetch Emacs packages from the Melpa mirror:
  
   #+BEGIN_SRC emacs-lisp
   (add-to-list &#39;package-archives &#39;(&#34;melpa&#34; . &#34;https://melpa.org/packages/&#34;))
   #+END_SRC
</pre>
<p>
This is fully self documented code (some argue Lisp is this by nature also). This is nicely rendered on Github, see <a href="https://github.com/larstvei/dot-emacs/blob/master/init.org">these</a> <a href="https://github.com/seth/my-emacs-dot-d/blob/master/emacs-init.org">two</a> examples to see what I mean. The pertinent advice here is: start with a <em>minimal</em> configuration and <em>only ever add things you understand</em>. I followed exactly this advice, and those two files were brilliant references. I would find an annoyance in Emacs, and one of those two org files would have something in Emacs to <del>fix</del> customise the issue I had.</p>
<p>
If you would like to see more, my <a href="https://github.com/dueyfinster/dotfiles">dotfiles</a> (with <a href="https://github.com/dueyfinster/dotfiles/blob/master/conf/emacs.d/emacs-init.org">my Emacs config</a> are available also.</p>
</div>
</div>

        </p>
    </div>
    

    

    <div class="page-footer">
        
        <hr class="footer-divider">
        
            <a class="tag" href="../tags/emacs">#emacs</a>
        
      
    </div>


        
        </div>
        <footer class="footer-mobile">
	<div class="social-icons">
        

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    

    
    
    

    
    
    

    

    

    

    

    

</div>




	<script src="../js/main.min.a7205ef73b078c8daed6fe1b0826e8ba229ffabbb69d299d9446cf41f2c7d8aa.js" integrity="sha256-pyBe9zsHjI2u1v4bCCbouiKf+ru2nSmdlEbPQfLH2Ko=" crossorigin="anonymous"></script>
</footer>
    </body>
</html>